Tekla Open API Reference for Tekla Structures 2025
ComponentItem Methods
The ComponentItem type exposes the following members.
Methods
Name | Description
Export
 Exports the custom component item in *.uel-format to the to given file name. If path is not given custom component is exported to model folder. If filename is empty custom component name is used as filename.
GetVersion
 Gets the version number of custom component item from the component database.
Select(String, Int32)
 Selects the component item from the component database. Uses the type if defined for selection
Select(String, Int32, ComponentItem.ComponentTypeEnum)
 Selects the component item from the component database.
Top
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace